[
  {
    "tense": "Past",
    "name": "Past Simple",
    "persion_name": "گذشته ساده",
    "description": "از این زمان برای اشاره به رخدادی که در زمانی در گذشته رخ داده و به پایان رسیده استفاده می کنیم. نکته مهم در استفاده از این فعل آن است که فعالیت مورد نظر حتما پایان یافته باشد.\nبرای ساخت این نوع فعل چناچه فعل بی قاعده نباشد باید به انتهای آن ed اضافه کرد.",
    "ex1": "I celebrated New Year’s Eve with my family last night.",
    "ex2": "I once loved him, now I don’t care about him anymore.",
    "ex3": "She saw a movie about WWII last night.",
    "formula": "Subject + verb (ed) or (irregular) + object.",
    "negative_description" : "برای ساختن جملات منفی منفی در گذشته ساده، از کمکی did not / didn't و شکل پایه فعل استفاده می کنیم.",
    "ex4": "I didn’t play football yesterday",
    "ex5": "They didn’t go to the theater last month.",
    "ex6": "She didn’t arrive on time this morning.",
    "negative_formula": "Subject + did not + base form of verb + object",
    "question_description": "برای ساختن سؤالات در گذشته ساده از «did» در مقابل فاعل و شکل پایه فعل استفاده می کنیم.",
    "question_formula": "Did + subject + base form of verb + object?",
    "ex7": "Did you play football yesterday?",
    "ex8": "Did they lose the match?",
    "ex9": "Did he clean his home last weekend?"
  },
  {
    "tense": "Past",
    "name": "Past continuous",
    "persion_name": "گذشته استمراری",
    "description": "از این زمان برای اشاره به رخدادی استفاده می شود که در مقطع زمانی خاصی در گذشته در حال انجام بوده است. در اینجا اینکه این فعالیت یا رخداد به پایان رسیده است یا خیر مدنظر نیست و اهمیتی ندارد. تمرکز صرفا بر روی استمرار فعالیت است.",
    "ex1": "I was studying for my English exam last night.",
    "ex2": "She was helping her mum in the housework.",
    "ex3": "We were sleeping.",
    "formula": "Subject + helping verb (was/were) + verb (ing) + object.",
    "negative_description" : "برای منفی کردن گذشته استمراری فقط کافیه not به جملمون اضافه کنیم",
    "ex4": "I was not studying for my English exam last night.",
    "ex5": "She was not helping her mum in the housework.",
    "ex6": "We were not sleeping.",
    "negative_formula": "Subject + helping verb (was/were) + not +verb (ing) + object.",
    "question_description": "برای ساختن سؤالات در گذشته استمراری فقط کافیه was/were رو اول جمله به کار ببریم.",
    "question_formula": "helping verb (was/were) + Subject + verb (ing) + object.",
    "ex7": "Were you reading a book?",
    "ex8": "Was she not helping her mum in the housework?",
    "ex9": "Were we not sleeping?"
  },
  {
    "tense": "Past",
    "name": "Past Perfect",
    "persion_name": "گذشته کامل",
    "description": "از این زمان برای اشاره به رخدادی استفاده می شود که قبل از رخداد دیگری در گذشته به اتمام رسیده باشد.",
    "ex1": "I’d finished my homework when he got home.",
    "ex2": "The party had ended by the time I woke up.",
    "ex3": "You had met him before.",
    "formula": "Subject + had + verb (ed) or (irregular) + object.",
    "negative_description" : "برای منفی کردن گذشته استمراری فقط کافیه not به جملمون اضافه کنیم",
    "ex4": "I had not finished my homework when he got home.",
    "ex5": "The party had not ended by the time I woke up.",
    "ex6": "You had not met him before.",
    "negative_formula": "Subject + had + not +verb (ed) or (irregular) + object.",
    "question_description": "برای ساختن سؤالات در گذشته کامل فقط کافیه had رو اول جمله به کار ببریم.",
    "question_formula": "helping verb (was/were) + Subject + verb (ing) + object.",
    "ex7": "Had you met him before.?",
    "ex8": "Had the party ended by the time I woke up?",
    "ex9": "Had You met him before?"
  },
  {
    "tense": "Past",
    "name": "Past perfect continuous",
    "persion_name": "گذشته کامل استمراری",
    "description": "از این زمان برای اشاره به اینکه رخدادی تا مقطع خاصی در گذشته به شکل استمراری در جریان بوده است استفاده می کند. پس این رخداد قبل از یک مقطع زمانی یا رخداد دیگری در گذشته قرار می گیرد و ممکن است زمان رسیدن به این نقطه همچنان در جریان باشد یا اینکه پایان یافته باشد.",
    "ex1": "She’d been working for three hours when she got a call from her boss.",
    "ex2": "I’d been trying to paint my room to no avail before he came and helped me.",
    "ex3": "She had been reading magazines for 1 month before she decided to apply for the job.",
    "formula": "Had + been + verb + ing",
    "negative_description" : "برای منفی کردن گذشته استمراری فقط کافیه not به جملمون اضافه کنیم",
    "ex4": "She had not been working for three hours when she got a call from her boss.",
    "ex5": "She had been reading magazines for 1 month before she decided to apply for the job.",
    "ex6": "She had not been going to the same hairdresser’s.",
    "negative_formula": "Subject + had + not +verb (ed) or (irregular) + object.",
    "question_description": "برای ساختن سؤالات در گذشته کامل فقط کافیه had رو اول جمله به کار ببریم.",
    "question_formula": "helping verb (was/were) + Subject + verb (ing) + object.",
    "ex7": "Had She been working for three hours when she got a call from her boss.?",
    "ex8": "Had you been trying to paint your room to no avail before he came and helped me?",
    "ex9": "Had She been reading magazines for 1 month before she decided to apply for the job.?"
  },
  {
    "tense": "Present",
    "name": "Present Simple",
    "persion_name": "حال ساده",
    "description": "از این زمان برای اشاره به حقایق عمومی و عادت های متداول و روزمره زندگی استفاده می شود.\nبرای ساخت این نوع فعل باید برای همه اشخاص به غیر از سوم شخص از شکل ساده فعل استفاده کرد. ضروری است که به انتهای فعل سوم شخص s یا es افزود.",
    "ex1": "Earth goes around the sun.",
    "ex2": "They live in Shiraz.",
    "ex3": "I wake up at 8 o’clock every morning.",
    "formula": "Subject + verb",
    "negative_description" : "برای منفی کردن گذشته استمراری فقط کافیه dont به جملمون اضافه کنیم",
    "ex4": "They dont live in Shiraz.",
    "ex5": "We dont want a sandwich.",
    "ex6": "I dont live in the city center.",
    "negative_formula": "Subject + dont +verb",
    "question_description": "برای ساختن سؤالات در حال ساده نیازه که به اول جمله برای (I/you/we/they) از do و برای (he/she/it) از does استفاده کنیم.",
    "question_formula": "Do/Does + Subject + verb",
    "ex7": "Do you think it’s a good idea?",
    "ex8": "Does it rain much here?",
    "ex9": "Do I have time for a coffee?"
  },
  {
    "tense": "Present",
    "name": "Present Continuous",
    "persion_name": "گذشته استمراری",
    "description": "از این زمان برای اشاره به عملی که دقیقا همین الان رخ می دهد یا عملی که برای شکل موقت در بازه زمانی در زمان حال در حال انجام است استفاده می کنیم.\nمثلا من الان مشغول تایپ کردن این مطالب هستم. این کاری است که در لحظه انجام می دهم. اما من این روزها هم یک کتاب داستان مطالعه می کنم. دقیقا در همین لحظه کتاب نمی خوانم ولی به شکل موقت این کتاب جزوی از حقیقت کنونی من است. برای هر دو موقعیت باید از حال استمراری استفاده کرد.",
    "ex1": "I’m writing an article about English tenses right now.",
    "ex2": "I’m reading a novel by Virginia Woolf.",
    "ex3": "She’s working in the garden.",
    "formula": "Be (am / is / are ) + verb + ing",
    "negative_description" : "برای منفی کردن گذشته استمراری فقط کافیه dont به جملمون اضافه کنیم",
    "ex4": "I’m not doing my homework.",
    "ex5": "My sister’s not sitting on the sofa.",
    "ex6": "They’re not riding their bikes.",
    "negative_formula": "Subject + am/is/are not + verb +ing",
    "question_description": "برای ساختن سؤالات در حال استمراری نیازه که فقط subject و am/is/are رو جا به جا کنیم.",
    "question_formula": "Am/is/are + subject + verb +ing",
    "ex7": "Are you doing your homework?",
    "ex8": "Is your sister sitting on the sofa?",
    "ex9": "Are they riding their bikes?"
  },
  {
    "tense": "Present",
    "name": "Present Perfect",
    "persion_name": "حال کامل",
    "description": "از این زمان برای چند حالت مختلف استفاده می کنیم:\nزمانی که عملی در گذشته شروع شده و تا به امروز همچنان ادامه دارد.\nزمانی که عملی در گذشته شروع شده و پایان یافته ولی همچنان بر زمان حال تاثیر گذار است.\nزمانی که درباره تجربیات زندگی صحبت می کنیم.",
    "ex1": "I have lived in Shiraz my whole life.",
    "ex2": "They can’t get in; they have lost their key.",
    "ex3": "She has been to England twice.",
    "formula": "Subject + Have / has + شکل سوم فعل",
    "negative_description" : "برای منفی کردن حال کامل فقط کافیه not به جملمون اضافه کنیم",
    "ex4": "I have lived in Shiraz my whole life.",
    "ex5": "She has not been to England twice.",
    "ex6": "They have not worked here.",
    "negative_formula": "Subject + Have / has + not + شکل سوم فعل",
    "question_description": "برای ساختن سؤالات در حال استمراری نیازه که فقط subject و have / has رو جا به جا کنیم.",
    "question_formula": "Have / has + Subject + شکل سوم فعل",
    "ex7": "Has she been to England twice?",
    "ex8": "Have they finded the key?",
    "ex9": "Have you lived in Shiraz?"
  },
  {
    "tense": "Present",
    "name": "Present Perfect Continuous",
    "persion_name": "حال کامل استمراری",
    "description": "از این زمان برای چند حالت مختلف استفاده می کنیم:\nرخدادی که در مقطعی در گذشته شروع شده و تا حال ادامه دارد.\nرخدادی که در گذشته شروع شده و پایان یافته ولی ما همچنان می توانیم نشانه های وقوع آن را دور و بر خودمان ببینیم. مثل وقتی که باران باریده و ما می توانیم زمان خیس را مشاهده کنیم.\nدرباره یک عادت جدید که تازه به روزمره ما اضافه شده است.",
    "ex1": "I’ve been writing this article for two hours.",
    "ex2": "Look at the ground. It’s wet. I think it’s been raining.",
    "ex3": "She’s been running a lot recently.",
    "formula": "Subject + Have / has + been + verb + ing",
    "negative_description" : "برای منفی کردن حال کامل استمراری فقط کافیه not به جملمون اضافه کنیم",
    "ex4": "I have not been writing this article for two hours..",
    "ex5": "They’ve not been talking all afternoon.",
    "ex6": "She has not been running a lot recently.",
    "negative_formula": "Subject + Have / has + not + شکل سوم فعل",
    "question_description": "برای ساختن سؤالات در حال استمراری کامل نیازه که فقط subject و have / has رو جا به جا کنیم.",
    "question_formula": "Have / has + Subject + been + verb + ing",
    "ex7": "Have they been talking all afternoon?",
    "ex8": "Has she not been running a lot recently?",
    "ex9": "Have we been waiting for an hour?"
  },
  {
    "tense": "Future",
    "name": "Future Simple",
    "persion_name": "آینده ساده",
    "description": "برای زمان حال آینده از دو نوع فعل مختلف استفاده می شود که هر کدام کاربردهای مخصوص به خود را دارند: be going to و will. بعد از هر دو این افعال باید از شکل ساده فعل استفاده کرد. \nکاربردهای will:\nتصمیمات آنی و لحظه ای\nوقتی که بر اساس یک نظر شخصی بر این باور هستیم که چیزی در آینده رخ خواهد داد.\nدرباره حقایق عمومی که در آینده رخ می دهند.\n\nکاربردهای be going to:\nبرنامه برای انجام کاری\nوقتی که بر اساس شواهد موجود بر این باور هستیم که اتفاقی رخ خواهد داد.\n\n.",
    "ex1": "I will answer the phone.",
    "ex2": "I think you will get into a good university.",
    "ex3": "I’m going to talk to him about the project soon.",
    "formula": "Subject + will/ going to",
    "negative_description" : "برای منفی کردن آینده ساده فقط کافیه not به جملمون اضافه کنیم",
    "ex4": "You will not be late .(you won't ..)",
    "ex5": "She will not get the job .(she won't..)",
    "ex6": "I’m not going to talk to him about the project soon.",
    "negative_formula": "Subject + will not / not going to",
    "question_description": "برای ساختن سؤالات در آینده ساده نیازه که فقط will به اول جملمون اضافه کنیم.",
    "question_formula": "Will + Subject",
    "ex7": "Will she dance?",
    "ex8": "Will she get the job?",
    "ex9": "Will you be late?"
  },
  {
    "tense": "Future",
    "name": "Future Continuous",
    "persion_name": "آینده استمراری",
    "description": "از این زمان برای اشاره به اینکه در بازه زمانی در آینده چیزی به شکل استمراری در جریان خواهد بود استفاده می کنیم.",
    "ex1": "I think you will be missing us a lot when you go to England.",
    "ex2": "This time next week I’ll be taking the entrance exam for university. It’s very scary.",
    "ex3": "He will be cooking dinner this evening.",
    "formula": "Subject + Will +be + verb + ing",
    "negative_description" : "برای منفی کردن آینده استمراری فقط کافیه not به جملمون اضافه کنیم",
    "ex4": "I will not be dancing all night.",
    "ex5": "I think you will not be missing us a lot when you go to England.",
    "ex6": "We will not be having dinner",
    "negative_formula": "Subject + Will + not +be + verb + ing",
    "question_description": "برای ساختن سؤالات در آینده استمراری نیازه که فقط will به اول جملمون اضافه کنیم.",
    "question_formula": "Will + Subject + not +be + verb + ing",
    "ex7": "Will he be playing football?",
    "ex8": "Will he be cooking dinner this evening?",
    "ex9": "Will we be having dinner?"
  },
  {
    "tense": "Future",
    "name": "Future Perfect",
    "persion_name": "آینده کامل",
    "description": "از این زمان برای اشاره به اینکه رخدادی در آینده قبل از زمان یا رخداد دیگری پایان خواهد یافت استفاده می کنیم.",
    "ex1": "We’ll have resolved the IT problem by this afternoon.",
    "ex2": "Let’s wait until 5 p.m. The game will have finished by then.",
    "ex3": "They’ll have painted the house before moving in.",
    "formula": "Subject + Will + have + شکل سوم فعل",
    "negative_description" : "برای منفی کردن آینده کامل فقط کافیه not به جملمون اضافه کنیم",
    "ex4": "They will not have painted the house before moving in",
    "ex5": "We will not have resolved the IT problem by this afternoon.",
    "ex6": "By next Friday we wont(will not) have moved into our new home!",
    "negative_formula": "Subject + Will + not + have + شکل سوم فعل",
    "question_description": "برای ساختن سؤالات در آینده کامل نیازه که فقط will به اول جملمون اضافه کنیم.",
    "question_formula": "Will + Subject + have + شکل سوم فعل",
    "ex7": "Will they have painted the house before moving in?",
    "ex8": "Will We not have resolved the IT problem by this afternoon?",
    "ex9": "Will you have written the contract by Friday?"
  },
  {
    "tense": "Future",
    "name": "Future Perfect Continuous",
    "persion_name": "آینده کامل استمراری",
    "description": "به رویدادها یا اقداماتی اشاره دارد که در حال حاضر ناتمام هستند اما در آینده به پایان خواهند رسید. اغلب با عبارت زمان استفاده می شود.",
    "ex1": "In a month, I’ll have been working here for a year.",
    "ex2": "Next December, she’ll have been living abroad for two years.",
    "ex3": "In three years, he will have been teaching for thirty years.",
    "formula": "Subject + Will + have + been + verb + ing",
    "negative_description" : "برای منفی کردن آینده استمراری کامل فقط کافیه not به جملمون اضافه کنیم",
    "ex4": "In three years, he will not have been teaching for thirty years.",
    "ex5": "Next December, she wont(will not) have been living abroad for two years.",
    "ex6": "In a month, I will not have been working here for a year.",
    "negative_formula": "Subject + Will + not + have + been + verb + ing",
    "question_description": "برای ساختن سؤالات در آینده استمراری کامل نیازه که فقط will به اول جملمون اضافه کنیم.",
    "question_formula": "Will + subject + have + been + verb + ing",
    "ex7": "Will he have been teaching for thirty years?",
    "ex8": "Will she have been living abroad for two years?",
    "ex9": "Will I have been working here for a year?"
  }
]